app/controllers/home_controller.rb

INSERT INTO "books" ("author", "name", "status") VALUES ($1, $2, $3) RETURNING "id"  [["author", "asdf"], ["name", "asdf"], ["status", false]]
SELECT "books".* FROM "books"
---
  def index

     if( params.has_key?(:name) && params.has_key?(:author) && params.has_key?(:status))
      #If new books creation request has come.

      #Extract parameters
      @name = params[:name]
      @author = params[:author]
      @status = false if ( params[:status] == "0" )
      @status = true if ( params[:status] == "1")

      #some checking constraints
      #put in database
      @book = Book.new( :name=> @name, :author => @author , :status => @status )
      @book.save()
     end

    @books = Book.all

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy
    #@book = Book.new( :name => 'destroy_book', :author => 'parag', :status => false  )
    #@book.save()
    Book.destroy(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", "151"]]
UPDATE "books" SET "name" = NULL, "author" = NULL, "status" = NULL WHERE "books"."id" = 4
---
  def update
    #@book = Book.new( :name => 'update_book', :author => 'parag', :status => false  )
    #@book.save()
    #for testing purpose
      @book = Book.find(params[:id])

      @name = params[:name]
      @author = params[:author]
      @status = false if ( params[:status] == "0" )
      @status = true if ( params[:status] == "1")
      @book.update_attributes( name: params[:name], author: params[:author] , status:  @status  )